import React, { useState } from 'react'
import { StyleSheet, ScrollView, View } from 'react-native'
import { Head, Card, Title } from '../../../components';
// import { font, width, height } from '../../../utils/Responsive';
import { useTranslation } from "react-i18next";

const Privacy = ({navigation}) => {

     const [toggle, setToggle] = useState(1);

     const { t, i18n } = useTranslation();
     const lang = i18n.language

     return (
          <View style={styles.root}>
               <Head 
                    handlePress={() => navigation.goBack()}
                    handlePressEnd={() => navigation.navigate('EditProfile') }
                    title={ lang === "english" ? "Privacy policy" : "سياسة الخصوصية" }
               />
               <ScrollView style={styles.screen} showsVerticalScrollIndicator={false}>
               <Card pushDown="4" pushRight="1" pushLeft="1">
                    <Title 
                         size="1.8" 
                         // lineHeight={28}
                         fontWeight="300" 
                         // letterSpacingText={.5}
                         textAlign={ lang === "arabic" ? "right" : "right" }
                         text={ 
                                   `يرحّب بكم فريق عمل تطبيق ريجاردز Regards ، ويتقدّم إليكم بالشكر على ثقتكم به، ويفيدكم تطبيق ريجاردز Regards بأنه حرصاً منه و لإدراكه التام بأن المستخدم له حقوق، فإن تطبيق ريجاردز Regards يسعى للحفاظ على المعلومات الخاصة بالمستخدمين وفقاً لآلية سياسة الخصوصية وسرية المعلومات المعمول بها في تطبيق ريجاردز Regards. وعليه فإن التطبيق يوضّح لكم بأن سياسة الخصوصية وسرية المعلومات التي سيتم التعامل مع معلوماتكم الخاصة بكم بموجبها كما يلي: 
                                   \n السياسة: 
                                   \n أولاً: المعلومات التي يحصل عليها تطبيق ريجاردز Regards ويحتفظ بها في قواعد بياناته
                                   \n • 	المعلومات الشخصية الخاصة بالمستخدم، كالإسم والعمر والبريد الالكتروني ورقم الجوال، ورقم الهوية الوطنية أو رقم الإقامة.  
                                   \n • 	معلومات الدخول الشخصية الخاصة بالمستخدم، مثل اسم المستخدم وكلمة السر والبريد الالكتروني، والسؤال الخاص باسترجاع كلمة السر وإجابته إن وجد. 
                                   \n • 	قد تفرض طبيعة المنصة الالكترونية بعض المعلومات المتعلّقة بالكوكيز وذلك لأغراض الكترونية تسهّل التعامل بين التطبيق والمستخدم. 
                                   \n ثانياً: هل تطبيق ريجاردز Regards يشارك هذه المعلومات؟ 
                                   \n •	 بطبيعة الحال فإن تطبيق ريجاردز Regards يسعى بالاحتفاظ بهذه المعلومات بما يحفظ خصوصية المستخدم، و تطبيق ريجاردز Regards لا يحتفظ بهذه المعلومات إلا بهدف تحسين جودة التطبيق الإلكتروني وتيسير التعامل فيما بين تطبيق ريجاردز Regards والمستخدم. 
                                   \n • كقاعدة عامة فإن جميع هذه المعلومات لا يطلع عليها إلا القائمين على تطبيق ريجاردز Regards ، ولن يقوموا بنشرها أو بثها للغير. 
                                   \n • حيث أن تطبيق ريجاردز Regards يسعى للحفاظ على سلامة المستخدمين، فإنه – في حالة ملاحظة تطبيق ريجاردز Regards لأي نشاط غير نظامي أو غير شرعي يقوم به المستخدم – فإن تطبيق ريجاردز Regards قد يقوم بإبلاغ الجهات المختصة بعد التشاور مع الجهة القانونية الخاصة بـ تطبيق ريجاردز Regards.
                                   \n ثالثاً: ما هو مدى أمان سرية المعلومات الخاصة بالتطبيق؟ 
                                   \n •	 يسعى تطبيق ريجاردز Regards إلى سرية المعلومات وسياسة الخصوصية الخاصة بالمستخدمين و لن يخالف أحكام هذه القواعد والسياسة. ولكن نظراً لعدم إمكانية ضمان ذلك 100% عبر وسائل الإنترنت فإن فريق عمل تطبيق ريجاردز Regards ينوّه بما يلي: 
                                   \n • يسعى تطبيق ريجاردز Regards بالحفاظ على جميع المعلومات الخاصة بالمستخدم وألا يطلع عليها أحد بما يخالف هذه السياسة المعمول بها في تطبيق ريجاردز Regards.
                                   \n • يعمل على حماية هذه المعلومات عن طريق سيرفرات معيّنة محمية بموجب أنظمة الحماية الإلكترونية.
                                   \n • غير أنه نظراً لأن شبكة الانترنت لا يمكن ضمانها 100% لما قد يطرأ من اختراق أو فيروسات على أنظمة الحماية الالكترونية وعلى جدران الحماية المعمول به في تطبيق ريجاردز Regards فإن التطبيق ينصح المستخدمين بالحفاظ على معلوماتهم بسرية تامة، وعدم إفشاء أي معلومات يراها المستخدم هامة جداً له، وهذا حرصاً من تطبيق ريجاردز Regards في توجيه وإرشاد المستخدمين. 
                                   \n رابعاً: هل هناك طرف ثالث في العلاقة بين تطبيق ريجاردز Regards والمستخدم؟ 
                                   \n • تحدد هنا سياسة الخصوصية فيما يتعلّق بالحالات التي يكون هناك طرفاً ثالث، كالمسوّقين، والتقنيين، والمستهلك، وأي شخص آخر مرتبط بالعلاقة
                                   \n • قد يتم التواصل معك على رقم هاتفك لأعلامك بأي تحديث يتعلق بحالة طلبك أو لأي اعلان عن آخر تخفيضاتنا وعروضنا الترويجية
                                   \n • نحن قد نمرر اسمك وعنوانك او بيانات الضيف المدخلة من قبل المستخدم إلى طرف ثالث من أجل تسليم المنتج (على سبيل المثال مزود الخدمة) أو لمساعدتنا في جمع المدفوعات منك أو لتحليل البيانات وتزويدنا معلومات تسويقية أو المساعدة خدمة العملاء. ونحن قد نتبادل المعلومات مع أطراف ثالثة لأغراض الحماية من الغش والحد من مخاطر الائتمان. بخلاف ما هو مبين في سياسة الخصوصية هذه لا يجوز لنا بيع أو الكشف عن البيانات الشخصية الخاصة بك إلى أطراف ثالثة دون الحصول على موافقة مسبقة منك إلا إذا كان ذلك ضروريا للأغراض المبينة في سياسة الخصوصية هذه ما لم يطلب منا القيام بذلك بموجب القانون.
                                   \n خامساً: قواعد وأحكام استخدام تطبيق ريجاردز Regards:
                                   \n إن جميع التزامات تطبيق ريجاردز Regards، وجميع التزامات المستخدمين، وجميع الحقوق الواردة في العلاقة بين المستخدم أو المستهلك وتطبيق ريجاردز Regards، موجودة هنا "رابط الشروط والأحكام"، حيث أن هذه القواعد هي "سياسة الخصوصية وسرية المعلومات" والمنبثقة من الاتفاقية التي أبرمت بين المستخدم و تطبيق ريجاردز Regards بخصوص العلاقة النظامية والقانونية بينهما، وقد وضعت سياسة الخصوصية وسرية المعلومات لضمان المصداقية والثقة التي تحرص تطبيق ريجاردز Regards على توفيرها للمستخدمين
                                   `
                         }
                    />
               </Card>
               </ScrollView>
          </View>
     )
}

const styles = StyleSheet.create({
     root : {
          flex : 1,
          backgroundColor : '#fff',
     },
     screen : {
          paddingHorizontal : '2.5%',
          marginBottom : "12%"

     }
})

export default Privacy