import React, { useState } from 'react'
import { StyleSheet, ScrollView, View } from 'react-native'
import { Head, Card, Title } from '../../../components';
// import { font, width, height } from '../../../utils/Responsive';
import { useTranslation } from "react-i18next";

const TermsAndConditions = ({navigation}) => {

     const [toggle, setToggle] = useState(1);

     const { t, i18n } = useTranslation();
     const lang = i18n.language

     return (
          <View style={styles.root}>
               <Head 
                    handlePress={() => navigation.goBack()}
                    handlePressEnd={() => navigation.navigate('EditProfile') }
                    title={t("TermsAndConditions")}
               />
               <ScrollView style={styles.screen} showsVerticalScrollIndicator={false}>
               <Card pushDown="4" pushRight="1" pushLeft="1">
                    <Title 
                         size="1.8" 
                         // lineHeight={28}
                         fontWeight="300" 
                         // letterSpacingText={.5}
                         textAlign={ lang === "arabic" ? "right" : "right" }
                         text={ 
                                   `مقدّمة اتفاقية الاستخدام: 
                                        \nتجدون أدناه الشروط والأحكام لمنصة ريجاردز Regards المُنظّمة لاستخدامكم لهذه المنصة وكافة الآثار القانونية التي تنتج عن استخدامكم لخدمات التطبيق عبر هذه المنصة الالكترونية، حيث أن استخدام أي شخصٍ كان لتطبيق ريجاردز Regards سواءً كان مستهلكاً أو غير ذلك فإن هذه تعد موافقة وقبول منه وهو بكامل أهليته المعتبرة شرعاً ونظاماً وقانوناً لكافة مواد وأحكام هذه الاتفاقية وهو تأكيد لالتزامكم بأنظمتها ولما ذُكر فيها، وتسري هذه الاتفاقية على جميع أنواع التعامل بين المستخدم وبين المنصة فيما عدا التعاملات المتعلّقة بالأحوال الشخصية. وتعتبر هذه الاتفاقية سارية المفعول ونافذة بمجرد قيامكم بالموافقة عليها والبدء في التسجيل بتطبيق ريجاردز Regards بموجب المادة العاشرة من نظام التعاملات الإلكترونية السعودي. 
                                        \nالمادة الأولى - المقدّمة والتعريفات: 
                                        \nيعتبر التمهيد أعلاه جزءاً لا يتجزأ من هذه الاتفاقية، كما تجدون أدناه الدلالات والتعريفات للعبارات الرئيسية المستخدمة في هذه الاتفاقية : 
                                        \n• (التطبيق) يقصَد بهذه العبارة تطبيق ريجاردز Regards، ويشمل هذا التعريف كافة أشكال تطبيق ريجاردز Regards على شبكة الإنترنت، سواءً كانت تطبيق إلكتروني، أو موقع الكتروني على شبكة الإنترنت، أو محل تجاري. 
                                        \n• (المستخدم) يقصَد بهذه العبارة كل مستهلك يقوم بشراء المنتج أو الخدمة من خلال التطبيق عبر منصته الالكترونية.      
                                        \n• (مزود الخدمة) يقصد بهذه العبارة الجهة المالكة (للخدمة أو المنتج) المعروضة في تطبيق ريجاردز.     
                                        \n• (الاتفاقية) يقصَد بهذه العبارة شروط وأحكام هذه الاتفاقية، والتي تحكم وتنظّم العلاقة فيما بين أطراف هذه الاتفاقية.      
                                        \nالمادة الثانية - أهلية المستخدم القانونية:  
                                        \n• يقر المستخدم بأنه ذا أهلية قانونية معتبرة شرعاً ونظاماً للتعامل مع المتجر، أو أن عمره لا يقل عن ثمانية عشرة عاماً. 
                                        \n• يوافق المستخدم بأنه في حال مخالفته لهذه المادة، فإنه يتحمّل تبعات هذه المخالفة أمام الغير. 
                                        \n المادة الثالثة - طبيعة التزام تطبيق ريجاردزRegards:
                                        \n• إن التزام تطبيق ريجاردز Regards تجاه المستهلكين أو المستخدمين هو إمكانية شراء (الخدمة أو المنتج) المملوكة لمزود الخدمة.
                                        \n• قد يوفّر تطبيق ريجاردز Regards خدمات أخرى كخدمات ما بعد البيع أو غيرها من الخدمات ذات العلاقة، وذلك يعود لطبيعة ونوع (الخدمة أو المنتج) المطلوبة من المستخدم. 
                                        \nالمادة الرابعة - ضوابط استخدام تطبيق ريجاردز :  
                                        \n• يلتزم المستخدم باستخدام تطبيق ريجاردز Regards بما يتّفق مع الآداب العامة والأنظمة المعمول بها في المملكة العربية السعودية. 
                                        \n• يلتزم المستخدم عند شرائه لخدمة أو منتج من خلال تطبيق ريجاردز Regards ألا يستخدم هذه الخدمة أو المنتج بما يخالف الآداب العامة والأنظمة المعمول بها في المملكة العربية السعودية.    
                                        \nالمادة الخامسة - الحسابات والتزامات التسجيل:   
                                        \nفور التقدم بطلب الانضمام إلى عضوية تطبيق ريجاردز Regards كمستخدم تكون ملتزماً بالإفصاح عن معلومات محددة وهي إدخال رقم الجوال الخاص بك وتأكيده من خلال رمز التأكيد الذي سيصلك عن طريق رسالة نصية لتتمكن من الاستفادة من خدمات تطبيق ريجاردز Regards. وبذلك تكون قد وافقت على: 
                                        \n• أن تكون مسؤولاً عن المحافظة على سرية معلومات حسابك ، وتكون بذلك موافقاً على إعلام تطبيق ريجاردز Regards حالاً بأي استخدام غير مفوض به لمعلومات حسابك لدى تطبيق ريجاردز Regards أو أي اختراق آخر لمعلوماتك السرية.       
                                        \n• لن يكون تطبيق ريجاردز Regards بأي حال من الأحوال مسؤولً عن أي خسارة قد تلحق بك بشكل مباشر أو غير مباشر معنويا أو ماديا نتيجة كشف معلومات حسابك.      
                                        \n• أنت تلتزم باستخدام حسابك لدى تطبيق ريجاردز Regards بنفسك، حيث إنك مسؤولاً عنه مسؤولية كاملة، وفي حال استخدام غيرك له فهذه قرينة على أنك قد فوّضته باستخدام التطبيق باسمك ولحسابك.      
                                        \n• أنت تلتزم عند استخدام تطبيق ريجاردز Regards أن تستخدمه بكل جدية ومصداقية.   
                                        \n• أنت تلتزم بالإفصاح عن معلومات حقيقية وصحيحة ومحدثة وكاملة وقانونية عن نفسك حسبما هو مطلوب أثناء التسجيل لدى تطبيق ريجاردز Regards وجميع البيانات المدخلة في حسابك، وتلتزم بتحديث بياناتك في تغييرها في الواقع أو في حال الحاجة إلى ذلك.    
                                        \n• إن تطبيق ريجاردز Regards يلتزم بالتعامل مع معلوماتك الشخصية وعناوين الاتصال بك بسريّة تامة. 
                                        \n• إذا تبيّن لـ تطبيق ريجاردز Regards بأنك أفصحت عن معلومات غير حقيقية، أو غير صحيحة أو غير راهنة أو غير كاملة أو غير قانونية او مخالفة لما جاء في اتفاقية الاستخدام، فإن تطبيق ريجاردز Regards يمتلك الحق في وقف أو تجميد أو إلغاء حسابك في التطبيق، وذلك دون إلحاق الأضرار بحقوق تطبيق ريجاردز Regards الأخرى ووسائلها المشروعة في استرداد حقوقها وحماية باقي المستخدمين. 
                                        \n• في حالة عدم الالتزام بأي مما ورد أعلاه فإن لإدارة تطبيق ريجاردز Regards الحق في إيقاف، أو إلغاء حسابك أو حجبك من الدخول لخدمات تطبيق ريجاردز Regards مرة أخرى.     
                                        \nالمادة السادسة - الاتصالات الإلكترونية ووسائل التواصل الرسمية: 
                                        \n• يوافق أطراف هذه الاتفاقية على أن التواصل يتم عبر البريد الإلكتروني ورقم الجوال المسجّل في التطبيق. 
                                        \n• يوافق المستخدم على أن جميع الاتفاقيات والإعلانات والبيانات والاتصالات الأخرى التي تزود بها الكترونياً تقوم مقام مثيلاتها المكتوبة، وهي حجة قائمة بذاتها، في تلبية الاحتياجات النظامية والشرعية.      
                                        \n• يوافق المستخدم على إمكانية التواصل معه وتبليغه بأي أحكام تخص هذه الاتفاقية أو تخص التعامل معه من خلال قيام إدارة تطبيق ريجاردز Regards ببث رسائل عامة ترد إلى كافة المستخدمين أو إلى مستخدمين محددين لـ تطبيق ريجاردزRegards.      
                                        \nالمادة السابعة - التعديلات على اتفاقية الاستخدام والرسوم :
                                        \n• إن تطبيق ريجاردز Regards قد يقوم بإعلامك عن أي تعديل على هذه الاتفاقية وفقاً لوسائل التواصل الرسمية بموجب هذه الاتفاقية، وبموجبه تتضاعف التزاماتك أو تتضاءل حقوقك وفقاً لأي تعديلات قد تجرى على هذه الاتفاقية.  
                                        \n• في حال الاعتراض على أي تعديل على إتفاقية الإستخدام يأمل منكم تطبيق ريجاردز Regards التوقف عن استخدام خدماته حيث أن مجرد دخولكم إلى حسابكم في تطبيق ريجاردز Regards أو استخدامكم لـ تطبيق ريجاردز Regards يُعد قبولًا منكم للتعديلات وموافقة كاملة تامة نافية للجهالة، ويقبل تطبيق ريجاردز Regards المناقشة في أي اقتراح بشأن هذه الأحكام. 
                                        \n• كافة الرسوم تحتسب بالريال السعودي، وعلى المستخدم دفع كافة الرسوم المستحقة بالتطبيق مضافاً إليها أي نفقات أخرى يضيفها تطبيق ريجاردز Regards ، على أن يتم السداد بواسطة الوسائل المعتمدة والمحددة والمتاحة عن طريق تطبيق ريجاردز Regards.
                                        \n• قد يفرض تطبيق ريجاردز Regards رسومًا على بعض المستخدمين وذلك يعتمد على العروض أو المنتجات أو الخدمات التي يطلبونها أو ما تفرضه الدولة من رسوم أو ضرائب على طبيعة المنتج أو الخدمة. 
                                        \n• يحتفظ تطبيق ريجاردز Regards بحقه في إضافة أو زيادة أو خفض أو خصم أي رسوم أو نفقات بموجب مواد وبنود وأحكام إتفاقية الإستخدام، على أي من المستخدمين أي كان سبب تسجيلهم. 
                                        \nالمادة الثامنة – خدمات الدفع في تطبيق ريجاردز Regards:
                                        \n• يوفّر تطبيق ريجاردز Regards عبر شركائه نظام الدفع والسداد في تطبيق ريجاردز Regards فيمكن أن يتم عبر الانترنت كليا من خلال خيارات الدفع المتوفرة على التطبيق أو من خلال أي طريقة دفع يوفرها تطبيق ريجاردز Regards من حين لآخر. 
                                        \n• نقبل المدفوعات عبر الإنترنت باستخدام بطاقة الائتمان / الخصم Visa و MasterCard بالريال السعودي.
                                        \n• جميع تفاصيل بطاقات الائتمان / الخصم ومعلومات التعريف الشخصية لن يتم تخزينها أو بيعها أو مشاركتها أو تأجيرها أو تأجيرها لأي طرف ثالث.
                                        \n• المملكة العربية السعودية هي المقر الرئيسي للشركة
                                        \n• لن يتعامل التطبيق أو يقدم أي خدمات أو منتجات لأي من دول مكتب مراقبة الأصول الأجنبية (OFAC) الخاضعة لعقوبات وفقًا لقانون المملكة العربية السعودية.
                                        \n• يلتزم تطبيق ريجاردز Regards بتحديد سعر الخدمة أو المنتج الذي يقوم بعرضه في متجره وفقاً للقيمة السوقية المتعارف عليها.      
                                        \n• يلتزم تطبيق ريجاردز Regards بتوفير فواتير وسندات قبض وسندات استلام لجميع المبالغ والأرباح التي تنشأ في التطبيق. 
                                        \n• يلتزم تطبيق ريجاردز Regards بتوفير المواصفات المحاسبية المتعارف عليها في متجره الالكتروني، تطبيقاً لأحكام هذه الاتفاقية، ولما في هذا التنظيم من مصالح قانونية واقتصادية وتجارية وتنظيمية. 
                                        \nالمادة التاسعة - معلوماتك الشخصية ومعلومات تفاصيل العمليات: 
                                        \n• يقر المستخدم بأنه يمنح تطبيق ريجاردز Regards حقاً غير محدود، وعالمي، ودائم وغير قابل للإلغاء، ومعفي من المصاريف، ومرخص باستخدام معلومات أو مواد شخصية أو غير ذلك مما وفرتها أو زودت بها منصة تطبيق ريجاردز Regards أو أعلنتها على التطبيق من خلال انضمامك إليه أو استخدامك له، وذلك عبر النماذج المخصصة للتواصل والتسجيل، أو عبر أية رسالة إلكترونية أو أي من قنوات الاتصال المتاحة بالمنصة. وذلك بهدف تحقيق أي من المصالح التي تراها المنصة. 
                                        \n• تخضع أحكام سرية المعلومات الخاصة بالمستهلكين لقواعد "سياسة الخصوصية وسرية المعلومات" الخاصة بـ تطبيق ريجاردز Regards ، ولما ورد في هذه الاتفاقية من أحكام متعلّقة بسرية المعلومات. 
                                        \nالمادة العاشرة – الملكية الفكرية: 
                                        \n• إن حقوق الملكية الفكرية الخاصة بـ تطبيق ريجاردز Regards هي حقوق مملوكة لـ منصة تطبيق ريجاردز Regards ملكية تامة، سواءً كانت مملوكة لها قبل تأسيس هذه المنصة الالكترونية أم بعد تأسيسها. 
                                        \n• يحترم المستخدم أو المستهلك حقوق الملكية الفكرية الخاصة بتطبيق ريجاردز Regards ، والتي من ضمنها تطبيق ريجاردز Regards نفسه، والكلمات والشعارات والرموز الأخرى الخاصة بتطبيق ريجاردز Regards أو المعروضة على تطبيق ريجاردز Regards، حيث أن تطبيق ريجاردز Regards، وكل حق يتبع تطبيق ريجاردز Regards، هي حقوق مملوكة ملكية فكرية كاملة لـ تطبيق ريجاردز Regards.
                                        \nالمادة الحادية عشرة - مسؤولية تطبيق ريجاردز Regards:
                                        \n• يلتزم تطبيق ريجاردز Regards بأن يمارس عمله التجاري عبر هذه المنصة الالكترونية بشكل نظامي ووفقاً للأنظمة المعمول بها في المملكة العربية السعودية، ووفقاً لأحكام هذه الاتفاقية. 
                                        \n• تطبيق ريجاردز Regards لا يتحمل أي مطالبات تنشأ عن أخطاء أو إهمال، سواء كانت ناتجة بشكل مباشر أو غير مباشر أو عرضي أو عن طريق المستخدم أو عن طريق طرف ثالث مثل مزود الخدمة. 
                                        \n• يلتزم تطبيق ريجاردز Regards ومنسوبيه ومُلّاكه ومن يمثّلهم بأن يكون (المنتج أو الخدمة) شرعية و مصرح به وفق قوانين وأنظمة المملكة العربية السعودية ويتم استخدامه لاغراض شرعية.
                                        \nالمادة الثانية عشرة – سرية المعلومات: 
                                        \n• يتخذ تطبيق ريجاردز Regards معايير (ملموسة وتنظيمية وتقنية) لحماية المستخدمين ومنع وصول شخص غير مفوض إلى معلومات المستخدمين الشخصية، وحفظها. 
                                        \n• تقر كمستخدم بأن شبكة الانترنت ليست وسيلة آمنة تماماً، وسرية معلوماتك الشخصية لا يمكن أن تكون مضمونة 100% عبر تطبيق ريجاردز Regards. 
                                        \n• تطبيق ريجاردز Regards ليس له سيطرة على أفعال أي طرف ثالث، أو الغير، مثل صفحات الانترنت الأخرى الموصولة عن طريق روابط إلى المنصة أو أطراف ثالثة تدعي أنها تمثلك وتمثل آخرين. 
                                        \n• أنت تعلم وتوافق على أن تطبيق ريجاردز Regards قد يستخدم معلوماتك التي زودتها بها، بهدف تقديم الخدمات لك في تطبيق ريجاردز Regards، ولإرسال رسائل تسويقية لك، وان الخصوصية في تطبيق ريجاردز Regards تضبط عمليات الجمع والمعالجة والاستخدام والتحويل لمعلومات هويتك الشخصية، وتخضع قواعد سرية المعلومات لـ "سياسة الخصوصية وسرية المعلومات" الخاصة بتطبيق ريجاردز Regards.
                                        \nالمادة الثالثة عشرة - تقييد الولوج أو العضوية: 
                                        \nيمكن لـ تطبيق ريجاردز Regards وقف أو إلغاء عضوية المستخدم أو تقييد دخول المستخدم إلى خدمات المنصة في أي وقت وبدون إنذار ولأي سبب، ودون تحديد. 
                                        \nالمادة الرابعة عشر - القانون أو النظام الواجب التطبيق: 
                                        \nاتفاقية الاستخدام هذه محكومة ومصاغة بحسب القوانين والأنظمة والتشريعات المعمول بها والسارية في المملكة العربية السعودية، وهي خاضعة تمامًا وكليًا للأنظمة المعمول بها لدى السلطات في المملكة العربية السعودية. 
                                        \nالمادة الخامسة عشر - أحكام عامة 
                                        \nمثل هذا الأمر لا يلغي صلاحية باقي المواد والبنود والأحكام الواردة في إتفاقية الإستخدام وتظل سارية حتى إشعار آخر من إدارة تطبيق ريجاردز Regards.
                                        \n• إتفاقية الإستخدام هذه - والتي قد وآخر بحسب مقتضى الحال - تُشكّل إتفاقية الإستخدام وآلية العمل والتفاهم والاتفاق والتعاقد بين تطبيق ريجاردز Regards وبين المستخدم، كما يوافق كلا أطراف هذه الاتفاقية على أن يوضع في عين الاعتبار ما يلي: 
                                        \n• إن اللغة العربية هي اللغة المعمول بها عند تفسير أحكام هذه الاتفاقية، أو عند ترجمتها إلى لغة أخرى. 
                                        \n• إن جميع الأسعار المعروضة على خدمات أو منتجات تطبيق ريجاردز Regards قد تعدّل بين حينٍ وآخر. 
                                        \n• إن العروض الترويجية أو التسويقية التي قد يضعها تطبيق ريجاردز Regards هي عروض مؤقتة، حيث أنه لـ تطبيق ريجاردز Regards الحق في تعديل هذه العروض الترويجية أو التسويقية في أي وقت أو إيقافها. 
                                        \n• يلتزم أطراف هذه الاتفاقية بالتعامل فيما بينهم بما لا يخالف القواعد الشرعية والأنظمة والقوانين المعمول بها ذات العلاقة بطبيعة التعامل بين تطبيق ريجاردز Regards والمستخدم. 
                                        \n• لا تُلغى اتفاقية الاستخدام هذه إلا بموجب قرار يصدر من إدارة تطبيق ريجاردز Regards.
                                        \n• تطبيق ريجاردز Regards له الحق في اظهار تعليقات وتقييمات العملاء للمنتجات أو الخدمات وإخفائها.
                                        \n• للتطبيق الحق أن يعمل ما يراه مناسب وما يرى انه يصب في مصلحة التطبيق.  
                                        \n• للتطبيق الحق في تعديل سياسة التطبيق في اي وقت وليس بالضرورة اشعار المستخدمين بذلك التعديل.
                                   `
                         }
                    />
                    <Card pushUp="2" pushDown="2">
                         <Title 
                              size="1.8" 
                              // lineHeight={28}
                              fontWeight="600" 
                              // letterSpacingText={.5}
                              textAlign={"center"}
                              text={  lang === "english" 
                                   ? 
                                        'سياسة الاستبدال والاسترجاع'
                                   :
                                        'سياسة الاستبدال والاسترجاع'
                              }
                         />
                    </Card>
                    <Title 
                         size="1.8" 
                         // lineHeight={28}
                         fontWeight="300" 
                         // letterSpacingText={.5}
                         textAlign={ lang === "arabic" ? "right" : "right" }
                         text={  lang === "english" 
                              ? 
                                   `تطبيق ريجاردز Regards يحرص دائما على ارضاء مستخدميه وتحسين خدمة وجوده الخدمات، الرجاء قراءة الشروط التالية الموضحة لمساعدتك
                                   \nمعلومات هامة : 
                                   \n1. نظرا لنوعية معظم منتجات أو خدمات تطبيق ريجاردز Regards معظم منتجات تطبيق ريجاردز Regards تخضع لمعايير خاصة.
                                   \n2. يرجي التواصل خلال ٢٤ ساعة من تقديم الطلب وتوضيح المشكلة لمساعدتك.
                                   \n3. يتم التعويض بشكل كامل للعميل في حالة المنتجات أو الخدمات المقدمة للحالات التالية، مثل :
                                   \n1- لم يكن المنتج أو الخدمة تتوافق مع الوصف المبين على تطبيق ريجاردز Regards
                                   \n4. آلية الاسترجاع للخدمات (غير المؤكدة) وحالات معينة نبين التالي :
                                   \n1- في حال عدم تجاوب مستلم الهدية خلال 30 يوم يتم استرجاع المبلغ في محفظة العميل .
                                   \n2- في حال رفض مستلم الهدية يتم استرجاع المبلغ في محفظة العميل .
                                   \n3- يتحمل العميل في حال الاسترجاع ١٠ ٪ من قيمة الطلب كرسوم خدمة.
                                   \n5- لا يتم استبدال أو استرجاع أي خدمة بعد تأكيدها من قبل مستلم الهدية.
                                   \nإذا كنت غير راضٍ لأي سبب من الأسباب عن الشراء يرجى إرسال رسالة واتس آب على الرقم: 920016692+
                                   \nاو خلال الايميل على: gcc@regards.sa
                                   `
                              :
                                   `تطبيق ريجاردز Regards يحرص دائما على ارضاء مستخدميه وتحسين خدمة وجوده الخدمات، الرجاء قراءة الشروط التالية الموضحة لمساعدتك
                                   \nمعلومات هامة : 
                                   \n1. نظرا لنوعية معظم منتجات أو خدمات تطبيق ريجاردز Regards معظم منتجات تطبيق ريجاردز Regards تخضع لمعايير خاصة.
                                   \n2. يرجي التواصل خلال ٢٤ ساعة من تقديم الطلب وتوضيح المشكلة لمساعدتك.
                                   \n3. يتم التعويض بشكل كامل للعميل في حالة المنتجات أو الخدمات المقدمة للحالات التالية، مثل :
                                   \n1- لم يكن المنتج أو الخدمة تتوافق مع الوصف المبين على تطبيق ريجاردز Regards
                                   \n4. آلية الاسترجاع للخدمات (غير المؤكدة) وحالات معينة نبين التالي :
                                   \n1- في حال عدم تجاوب مستلم الهدية خلال 30 يوم يتم استرجاع المبلغ في محفظة العميل .
                                   \n2- في حال رفض مستلم الهدية يتم استرجاع المبلغ في محفظة العميل .
                                   \n3- يتحمل العميل في حال الاسترجاع 10٪ من قيمة الطلب كرسوم خدمة.
                                   \n4- لا يتم استبدال أو استرجاع أي خدمة بعد تأكيدها من قبل مستلم الهدية.
                                   \nإذا كنت غير راضٍ لأي سبب من الأسباب عن الشراء يرجى إرسال رسالة واتس آب على الرقم: 920016692
                                   \nاو خلال الايميل على: gcc@regards.sa
                                   `
                         }
                    />
               </Card>
               </ScrollView>
          </View>
     )
}

const styles = StyleSheet.create({
     root : {
          flex : 1,
          backgroundColor : '#fff',
     },
     screen : {
          paddingHorizontal : '2.5%',
          marginBottom : "12%"
     }
})

export default TermsAndConditions